In [1]:

import numpy as np
import pandas as pd

In [2]:
# creating a dataFrame with duplicate rows

df = pd.DataFrame({"Name":["Jack", "Jill", "John", "Jack"], "Rank":[1,21,3,1], "Marks":[99,56,97,99]})
df

   Name  Rank  Marks
0  Jack     1     99
1  Jill    21     56
2  John     3     97
3  Jack     1     99

In [3]:
# dropiing the duplicate rows but keeping the first row that has a duplicate below in the dataset

df.drop_duplicates(keep='first')

   Name  Rank  Marks
0  Jack     1     99
1  Jill    21     56
2  John     3     97

In [4]:
# drop all the duplicate rows, so not keep any duplicate rows

df.drop_duplicates(keep=False)

   Name  Rank  Marks
1  Jill    21     56
2  John     3     97

In [5]:
df

   Name  Rank  Marks
0  Jack     1     99
1  Jill    21     56
2  John     3     97
3  Jack     1     99

In [11]:
df.Marks.describe()

count     4.000000
mean     87.750000
std      21.187654
min      56.000000
25%      86.750000
50%      98.000000
75%      99.000000
max      99.000000
Name: Marks, dtype: float64

In [12]:
# changing the dataset by settig inplace  to true


df.drop_duplicates(keep='first', inplace=True)
df

   Name  Rank  Marks
0  Jack     1     99
1  Jill    21     56
2  John     3     97

In [13]:
df

   Name  Rank  Marks
0  Jack     1     99
1  Jill    21     56
2  John     3     97

In [14]:
data_1 = pd.DataFrame({"City":["Mumbai", "New York", "London", "San Francisco"], "Ratings":[np.nan,2,np.nan,1], "Average Age":[np.nan,70,85,np.nan]})
data_1

            City  Ratings  Average Age
0         Mumbai      NaN          NaN
1       New York      2.0         70.0
2         London      NaN         85.0
3  San Francisco      1.0          NaN

In [15]:
data_1.dropna(thresh=2)

            City  Ratings  Average Age
1       New York      2.0         70.0
2         London      NaN         85.0
3  San Francisco      1.0          NaN

In [16]:

data_1

            City  Ratings  Average Age
0         Mumbai      NaN          NaN
1       New York      2.0         70.0
2         London      NaN         85.0
3  San Francisco      1.0          NaN

In [17]:
#filling Nan value in Rating  column with mean of the Ratings column

data_1['Ratings'].fillna(data_1['Ratings'].mean(), inplace = True)
data_1

            City  Ratings  Average Age
0         Mumbai      1.5          NaN
1       New York      2.0         70.0
2         London      1.5         85.0
3  San Francisco      1.0          NaN

In [18]:
#filling Nan value in Average Age  column with median of the Average Age column

data_1['Average Age'].fillna(data_1['Average Age'].median(), inplace = True)
data_1

            City  Ratings  Average Age
0         Mumbai      1.5         77.5
1       New York      2.0         70.0
2         London      1.5         85.0
3  San Francisco      1.0         77.5

In [20]:
data_1

            City  Ratings  Average Age
0         Mumbai      1.5         77.5
1       New York      2.0         70.0
2         London      1.5         85.0
3  San Francisco      1.0         77.5

In [24]:

countryData = pd.DataFrame({"Country":["France","Spain", "Germany", "USA"], "Age":[np.nan,45,np.nan,32], "Salary":[np.nan,90000,np.nan,75000]})
countryData

   Country   Age   Salary
0   France   NaN      NaN
1    Spain  45.0  90000.0
2  Germany   NaN      NaN
3      USA  32.0  75000.0

In [25]:
countryData

   Country   Age   Salary
0   France   NaN      NaN
1    Spain  45.0  90000.0
2  Germany   NaN      NaN
3      USA  32.0  75000.0

In [29]:
import numpy as np
import pandas as pd

import scipy
import seaborn as sns
from matplotlib import pyplot as plt

from sklearn.preprocessing
import Imputer

imp = Imputer(missing_values='NaN', strategy='mean', axis=0)

SyntaxError: invalid syntax (<ipython-input-29-7c699386c963>, line 8)